<template>
  <footer class="pt-[200px] pb-[0px] fot" id="cont">
    <div class="containera">
      <ui-elements-title title="Контакты" />
      <div class="flex justify-between items-start flex-wrap pt-[70px] vbv">
        <div class="flex flex-col gap-[32px] ddd">
          <div class="flex items-center gap-[24px]">
            <svg xmlns="http://www.w3.org/2000/svg" width="46" height="44" viewBox="0 0 46 44" fill="none">
              <path d="M30.233 28.7272L31.297 27.6613C32.767 26.1884 35.056 25.8849 36.9367 26.9155L41.3933 29.3602C44.2563 30.9296 44.8887 34.7766 42.651 37.019L39.3377 40.3413C38.493 41.1884 37.4477 41.8049 36.2437 41.9178M2.00666 10.8119C1.925 9.3531 2.60166 8.04016 3.61433 7.02369L7.27766 3.3531C9.317 1.30604 12.7563 1.62369 14.5367 4.02134L17.479 7.98369C18.9187 9.92251 18.7623 12.5766 17.1127 14.2284L16.4453 14.9013" stroke="black" stroke-width="3"/>
              <path opacity="0.5" d="M36.2438 41.918C32.4405 42.2756 23.1445 41.8803 13.2372 31.9462C3.89217 22.5768 2.21684 14.5462 2.00684 10.8145" stroke="black" stroke-width="3"/>
              <path opacity="0.5" d="M30.2329 28.7267C30.2329 28.7267 27.7082 31.2584 20.8132 24.3455C13.9182 17.4326 16.4452 14.8984 16.4452 14.8984" stroke="black" stroke-width="3" stroke-linecap="round"/>
            </svg>
            <a href="tel:+79038723333" class="text-[26px] font-[600]">+7 (903) 872-33-33</a>
          </div>
          <div class="flex items-center gap-[24px]">
            <svg xmlns="http://www.w3.org/2000/svg" width="46" height="46" viewBox="0 0 46 46" fill="none">
              <path d="M2 22.4612C2 14.3391 2 10.2769 4.4612 7.75478C6.9203 5.23047 10.8809 5.23047 18.8 5.23047H27.2C35.1191 5.23047 39.0797 5.23047 41.5388 7.75478C44 10.2769 44 14.3391 44 22.4612V26.7689C44 34.8911 44 38.9532 41.5388 41.4754C39.0797 43.9997 35.1191 43.9997 27.2 43.9997H18.8C10.8809 43.9997 6.9203 43.9997 4.4612 41.4754C2 38.9532 2 34.8911 2 26.7689V22.4612Z" stroke="black" stroke-width="3"/>
              <path opacity="0.5" d="M12.4988 5.23077V2M33.4988 5.23077V2M3.04883 16H42.9488" stroke="black" stroke-width="3" stroke-linecap="round"/>
              <path d="M35.0994 33.2311C35.0994 33.6738 34.9278 34.0959 34.6263 34.4051C34.3253 34.7139 33.9196 34.885 33.4994 34.885C33.0792 34.885 32.6736 34.7139 32.3725 34.4051C32.071 34.0959 31.8994 33.6738 31.8994 33.2311C31.8994 32.7885 32.071 32.3664 32.3725 32.0572C32.6736 31.7484 33.0792 31.5773 33.4994 31.5773C33.9196 31.5773 34.3253 31.7484 34.6263 32.0572C34.9278 32.3664 35.0994 32.7885 35.0994 33.2311ZM35.0994 24.6158C35.0994 25.0584 34.9279 25.4805 34.6263 25.7897C34.3253 26.0985 33.9196 26.2696 33.4994 26.2696C33.0792 26.2696 32.6736 26.0985 32.3725 25.7897C32.071 25.4805 31.8994 25.0584 31.8994 24.6158C31.8994 24.1731 32.071 23.7511 32.3725 23.4418C32.6736 23.133 33.0792 22.9619 33.4994 22.9619C33.9196 22.9619 34.3253 23.133 34.6263 23.4418C34.9279 23.7511 35.0994 24.1731 35.0994 24.6158ZM24.5994 33.2311C24.5994 33.6738 24.4278 34.0959 24.1263 34.4051C23.8252 34.7139 23.4196 34.885 22.9994 34.885C22.5792 34.885 22.1736 34.7139 21.8725 34.4051C21.571 34.0959 21.3994 33.6738 21.3994 33.2311C21.3994 32.7885 21.571 32.3664 21.8725 32.0572C22.1736 31.7484 22.5792 31.5773 22.9994 31.5773C23.4196 31.5773 23.8252 31.7484 24.1263 32.0572C24.4278 32.3664 24.5994 32.7885 24.5994 33.2311ZM24.5994 24.6158C24.5994 25.0584 24.4278 25.4805 24.1263 25.7897C23.8252 26.0985 23.4196 26.2696 22.9994 26.2696C22.5792 26.2696 22.1736 26.0985 21.8725 25.7897C21.571 25.4805 21.3994 25.0584 21.3994 24.6158C21.3994 24.1731 21.571 23.7511 21.8725 23.4418C22.1736 23.133 22.5792 22.9619 22.9994 22.9619C23.4196 22.9619 23.8252 23.133 24.1263 23.4418C24.4278 23.7511 24.5994 24.1731 24.5994 24.6158ZM14.0994 33.2311C14.0994 33.6738 13.9278 34.0959 13.6263 34.4051C13.3252 34.7139 12.9196 34.885 12.4994 34.885C12.0792 34.885 11.6736 34.7139 11.3725 34.4051C11.071 34.0959 10.8994 33.6738 10.8994 33.2311C10.8994 32.7885 11.071 32.3664 11.3725 32.0572C11.6736 31.7484 12.0792 31.5773 12.4994 31.5773C12.9196 31.5773 13.3252 31.7484 13.6263 32.0572C13.9278 32.3664 14.0994 32.7885 14.0994 33.2311ZM14.0994 24.6158C14.0994 25.0584 13.9278 25.4805 13.6263 25.7897C13.3252 26.0985 12.9196 26.2696 12.4994 26.2696C12.0792 26.2696 11.6736 26.0985 11.3725 25.7897C11.071 25.4805 10.8994 25.0584 10.8994 24.6158C10.8994 24.1731 11.071 23.7511 11.3725 23.4418C11.6736 23.133 12.0792 22.9619 12.4994 22.9619C12.9196 22.9619 13.3252 23.133 13.6263 23.4418C13.9278 23.7511 14.0994 24.1731 14.0994 24.6158Z" fill="black" stroke="black"/>
            </svg>
            <p class="text-[26px] font-[600]">Пн-Пт: 8:00-17:00<br>Сб-Вс: выходной</p>
            <ul>
              <li class="text-[26px] font-[600]">офис</li>
            </ul>
          </div>
          <div class="flex items-center gap-[24px]">
            <svg xmlns="http://www.w3.org/2000/svg" width="46" height="46" viewBox="0 0 46 46" fill="none">
              <path d="M2 22.4612C2 14.3391 2 10.2769 4.4612 7.75478C6.9203 5.23047 10.8809 5.23047 18.8 5.23047H27.2C35.1191 5.23047 39.0797 5.23047 41.5388 7.75478C44 10.2769 44 14.3391 44 22.4612V26.7689C44 34.8911 44 38.9532 41.5388 41.4754C39.0797 43.9997 35.1191 43.9997 27.2 43.9997H18.8C10.8809 43.9997 6.9203 43.9997 4.4612 41.4754C2 38.9532 2 34.8911 2 26.7689V22.4612Z" stroke="black" stroke-width="3"/>
              <path opacity="0.5" d="M12.4988 5.23077V2M33.4988 5.23077V2M3.04883 16H42.9488" stroke="black" stroke-width="3" stroke-linecap="round"/>
              <path d="M35.0994 33.2311C35.0994 33.6738 34.9278 34.0959 34.6263 34.4051C34.3253 34.7139 33.9196 34.885 33.4994 34.885C33.0792 34.885 32.6736 34.7139 32.3725 34.4051C32.071 34.0959 31.8994 33.6738 31.8994 33.2311C31.8994 32.7885 32.071 32.3664 32.3725 32.0572C32.6736 31.7484 33.0792 31.5773 33.4994 31.5773C33.9196 31.5773 34.3253 31.7484 34.6263 32.0572C34.9278 32.3664 35.0994 32.7885 35.0994 33.2311ZM35.0994 24.6158C35.0994 25.0584 34.9279 25.4805 34.6263 25.7897C34.3253 26.0985 33.9196 26.2696 33.4994 26.2696C33.0792 26.2696 32.6736 26.0985 32.3725 25.7897C32.071 25.4805 31.8994 25.0584 31.8994 24.6158C31.8994 24.1731 32.071 23.7511 32.3725 23.4418C32.6736 23.133 33.0792 22.9619 33.4994 22.9619C33.9196 22.9619 34.3253 23.133 34.6263 23.4418C34.9279 23.7511 35.0994 24.1731 35.0994 24.6158ZM24.5994 33.2311C24.5994 33.6738 24.4278 34.0959 24.1263 34.4051C23.8252 34.7139 23.4196 34.885 22.9994 34.885C22.5792 34.885 22.1736 34.7139 21.8725 34.4051C21.571 34.0959 21.3994 33.6738 21.3994 33.2311C21.3994 32.7885 21.571 32.3664 21.8725 32.0572C22.1736 31.7484 22.5792 31.5773 22.9994 31.5773C23.4196 31.5773 23.8252 31.7484 24.1263 32.0572C24.4278 32.3664 24.5994 32.7885 24.5994 33.2311ZM24.5994 24.6158C24.5994 25.0584 24.4278 25.4805 24.1263 25.7897C23.8252 26.0985 23.4196 26.2696 22.9994 26.2696C22.5792 26.2696 22.1736 26.0985 21.8725 25.7897C21.571 25.4805 21.3994 25.0584 21.3994 24.6158C21.3994 24.1731 21.571 23.7511 21.8725 23.4418C22.1736 23.133 22.5792 22.9619 22.9994 22.9619C23.4196 22.9619 23.8252 23.133 24.1263 23.4418C24.4278 23.7511 24.5994 24.1731 24.5994 24.6158ZM14.0994 33.2311C14.0994 33.6738 13.9278 34.0959 13.6263 34.4051C13.3252 34.7139 12.9196 34.885 12.4994 34.885C12.0792 34.885 11.6736 34.7139 11.3725 34.4051C11.071 34.0959 10.8994 33.6738 10.8994 33.2311C10.8994 32.7885 11.071 32.3664 11.3725 32.0572C11.6736 31.7484 12.0792 31.5773 12.4994 31.5773C12.9196 31.5773 13.3252 31.7484 13.6263 32.0572C13.9278 32.3664 14.0994 32.7885 14.0994 33.2311ZM14.0994 24.6158C14.0994 25.0584 13.9278 25.4805 13.6263 25.7897C13.3252 26.0985 12.9196 26.2696 12.4994 26.2696C12.0792 26.2696 11.6736 26.0985 11.3725 25.7897C11.071 25.4805 10.8994 25.0584 10.8994 24.6158C10.8994 24.1731 11.071 23.7511 11.3725 23.4418C11.6736 23.133 12.0792 22.9619 12.4994 22.9619C12.9196 22.9619 13.3252 23.133 13.6263 23.4418C13.9278 23.7511 14.0994 24.1731 14.0994 24.6158Z" fill="black" stroke="black"/>
            </svg>
            <p class="text-[26px] font-[600]">Пн-Пт: 7:00-16:00<br>Сб-Вс: выходной</p>
            <ul>
              <li class="text-[26px] font-[600]">производство</li>
            </ul>
          </div>
          <div class="flex items-center gap-[24px]">
            <svg xmlns="http://www.w3.org/2000/svg" width="42" height="32" viewBox="0 0 42 32" fill="none">
              <path d="M4.2 32C3.045 32 2.0566 31.6087 1.2348 30.826C0.413 30.0433 0.0014 29.1013 0 28V4C0 2.9 0.4116 1.95867 1.2348 1.176C2.058 0.393333 3.0464 0.00133333 4.2 0H37.8C38.955 0 39.9441 0.392 40.7673 1.176C41.5905 1.96 42.0014 2.90133 42 4V28C42 29.1 41.5891 30.042 40.7673 30.826C39.9455 31.61 38.9564 32.0013 37.8 32H4.2ZM21 18L4.2 8V28H37.8V8L21 18ZM21 14L37.8 4H4.2L21 14ZM4.2 8V4V28V8Z" fill="black"/>
            </svg>
            <a href="mailto:gk-rtz@mail.ru" class="text-[26px] font-[600]">gk-rtz@mail.ru</a>
          </div>
          <div>
            <p class="text-[26px] font-[700]">Офис:</p>
            <p class="text-[26px]">241037, г. Курск,<br>Литовская 6г.</p>
          </div>
        </div>
        <div class="flex flex-col gap-[28px] sss">
          <h3 class="text-[26px] font-[700]">Реквизиты:</h3>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">ИНН:</p>
            <p class="text-[16px]">4632299801</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">КПП:</p>
            <p class="text-[16px]">463201001</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">ОГРН:</p>
            <p class="text-[16px]">1234600007575</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">ОКПО:</p>
            <p class="text-[16px]">94934306</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">Рас./ счет</p>
            <p class="text-[16px]">40702810433000011965</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">Коор./ счет:</p>
            <p class="text-[16px]">30101810300000000606</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">БИК:</p>
            <p class="text-[16px]">043807606</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">Банк:</p>
            <p class="text-[16px] max-w-[200px]">Курское отделение №8596 ПАО "СберБанк"</p>
          </div>
          <div class="flex items-center">
            <p class="w-[175px] text-[16px] font-[600]">Ген.директор:</p>
            <p class="text-[16px]">Филатов Антон Игоревич</p>
          </div>
        </div>
      </div>
      <div class="pt-[80px] flex justify-between flex-wrap adfsdfd">
        <div class="maps aa">
          <YandexMap class="mas" />
        </div>
        <div class="maps">
          <iframe src="https://www.google.com/maps/embed?pb=!1m17!1m12!1m3!1d1808.426252691407!2d36.17602089285537!3d51.70507706317878!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m2!1m1!2zNTHCsDQyJzE4LjEiTiAzNsKwMTAnMzguNCJF!5e0!3m2!1sru!2suk!4v1722804777436!5m2!1sru!2suk" width="650" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
        </div>
      </div>
    </div>
    <div class="containera">
      <div class="wrpdev">
        <div class="flex gap-[40px] justify-center dev">
          <div class="flez">
            <p>
              Дизайнер сайта: Виктория Бодрова
            </p>
            <a class="dev__desktop" href="https://t.me/neftinc">
              Контакты: <u>@neftinc (Телеграмм).</u>
            </a>
            <a class="dev__mobile" href="https://t.me/neftinc">
              <u>@neftinc (Телеграмм).</u>
            </a>
          </div>
          <div class="flez">
            <p>
              Командна разработки: Александр Фигуркин
            </p>
            <a class="dev__desktop" href="https://t.me/SvetskiyS">
              Контакты: <u>@SvetskiyS (Телеграмм).</u>
            </a>
            <a class="dev__mobile" href="https://t.me/SvetskiyS">
              <u>@SvetskiyS (Телеграмм).</u>
            </a>
          </div>
        </div>
      </div>
    </div>
  </footer>
</template>

<script setup>

</script>

<style lang="scss" scoped>
.dev__mobile{
  display: none;
}
.dev{
  border-radius: 40px;
  border: 1px solid black;
  padding: 0px 12px;
}
.wrpdev{
  max-width: 500px;
  margin: 0 auto;
  & p,a{
    font-size: 10px;
  }
}
@media screen and (max-width: 789px) {
  .dev{
    flex-wrap: wrap;
    justify-content: flex-start;
    row-gap: 8px;
    padding: 12px 48px;
  }
  .wrpdev{
    & p,a{
      font-size: 8px;
    }
  }
}
@media screen and (max-width: 426px) {
  .dev__mobile{
    display: flex;
  }
  .dev__desktop{
    display: none;
  }
  .dev{
    padding: 12px 24px;
  }
  .flez{
    display: flex;
    gap: 8px;
  }
}
@media screen and (max-width: 389px) {
  .dev{
    padding: 12px 12px;
  }
}
@media screen and (max-width: 360px) {
  .dev{
    padding: 12px 12px;
    * {
      font-size: 12px;
    }
  }
}
li{
  list-style: inside;
  padding-left: 20px;
}
.maps{
  border: 2px solid #000;
}
@media screen and (max-width: 1440px) {
  .adfsdfd{
    justify-content: center;
    gap: 24px;
  }
  iframe{
    width: 600px;
  }
}
@media screen and (max-width: 630px) {
  iframe{
    width: 300px;
  }
  .sss{
    gap: 12px;
    & > div{
      & p:nth-child(1){
        width: 120px;
      }
    }
  }
  .ddd{
    & > div{
      flex-direction: column;
      align-items: flex-start;
      & p{
        font-size: 18px;
      }
      & li{
        font-size: 18px;
      }
    }
  }
  .vbv{
    gap: 48px;
  }
  .fot{
    padding-top: 92px;
  }
}
@media screen and (max-width: 1024px){
  .mas{
    width: 600px;
  }
  iframe{
    width: 600px;
  }
}
@media screen and (max-width: 425px){
  .mas{
    width: 360px;
  }
  iframe{
    width: 360px;
  }
}
@media screen and (max-width: 490px){
  .mas{
    width: 400px !important;
  }
  iframe{
    width: 400px;
  }
}
@media screen and (max-width: 460px){
  .mas{
    width: 360px !important;
  }
  iframe{
    width: 360px;
  }
}
@media screen and (max-width: 390px){
  .mas{
    width: 330px !important;
  }
  iframe{
    width: 330px;
  }
}
@media screen and (max-width: 340px){
  .mas{
    width: 310px !important;
  }
  iframe{
    width: 310px;
  }
}
@media screen and (max-width: 320px){
  .mas{
    width: 290px !important;
  }
  iframe{
    width: 290px;
  }
}
</style>